coordinator/src/resources/tracker_request.mustache

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:hl7="urn:hl7-org:v3">
    <SOAP-ENV:Header>
        <wsa:MessageID>uuid:{{message_id}}</wsa:MessageID>
        <wsa:Action>urn:nhs:names:services:mmquery/QURX_IN000005UK99</wsa:Action>
        <wsa:To>https://pds-sync.national.ncrs.nhs.uk/syncservice-pds/pds</wsa:To>
        <wsa:From>
            <wsa:Address/>
        </wsa:From>
        <hl7:communicationFunctionRcv>
            <hl7:device>
                <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="{{to_asid}}"/>
            </hl7:device>
        </hl7:communicationFunctionRcv>
        <hl7:communicationFunctionSnd>
            <hl7:device>
                <hl7:id root="1.2.826.0.1285.0.2.0.107" extension="{{from_asid}}"/>
            </hl7:device>
        </hl7:communicationFunctionSnd>
        <wsa:ReplyTo>
            <wsa:Address/>
        </wsa:ReplyTo>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <QURX_IN000005UK99 xmlns="urn:hl7-org:v3">
            <id root="{{message_id}}"/>
            <creationTime value="20220711135728"/>
            <versionCode code="V3NPfIT4.2.00"/>
            <interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="QURX_IN000005UK99"/>
            <processingCode code="P"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="NE"/>
            <communicationFunctionRcv>
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.826.0.1285.0.2.0.107" extension="{{to_asid}}"/>
                </device>
            </communicationFunctionRcv>
            <communicationFunctionSnd>
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="1.2.826.0.1285.0.2.0.107" extension="{{from_asid}}"/>
                </device>
            </communicationFunctionSnd>
            <ControlActEvent classCode="CACT" moodCode="EVN">
                <author1 typeCode="AUT">
                    <AgentSystemSDS classCode="AGNT">
                        <agentSystemSDS classCode="DEV" determinerCode="INSTANCE">
                            <id root="1.2.826.0.1285.0.2.0.107" extension="{{from_asid}}"/>
                        </agentSystemSDS>
                    </AgentSystemSDS>
                </author1>
                <query xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:hl7-org:v3 ../Schemas/QURX_MT000005UK01.xsd">
                    <organization.id>
                        <value root="1.2.826.0.1285.0.1.10" extension="AB123"/>
                        <semanticsText>Organization.id</semanticsText>
                    </organization.id>
                    <prescription.id>
                        <value root="{{prescription_id}}"/>
                        <semanticsText>Prescription.id</semanticsText>
                    </prescription.id>
                    <!-- Optional RepeatNumber to request a specific instance (value)  -->
                    <prescription.repeatNumber value="{{repeat_number}}"/>
                    <requesterOrganizationType>
                        <value code="999" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.128"/>
                        <semanticsText>RequesterOrganizationType</semanticsText>
                    </requesterOrganizationType>
                </query>
            </ControlActEvent>
        </QURX_IN000005UK99>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>